project-chip/connectedhomeip/examples/all-devices-app/esp32/main/main.cpp
    if (gDeviceType == "*" || gDeviceType == "aggregator")
    {
        if (deviceFactory.IsValidDevice("aggregator") && deviceFactory.IsValidDevice("bridged-node"))
        {
            auto aggregator = deviceFactory.Create("aggregator");
            if (aggregator.device == nullptr)
            {
                ESP_LOGE(TAG, "Failed to create aggregator");
                return nullptr;
            }
            EndpointId aggregatorEp = endpointIdAllocator.Allocate();
            endpointIdAllocator.ForceNext(aggregatorEp);
            ESP_LOGI(TAG, "Registering aggregator on endpoint %u", aggregatorEp);
            err = aggregator.device->Register(endpointIdAllocator, dataModelProvider,
                                              EndpointComposition::WithParent(kInvalidEndpointId));
            if (err != CHIP_NO_ERROR)
            {
                ESP_LOGE(TAG, "Failed to register aggregator on endpoint %u: %" CHIP_ERROR_FORMAT, aggregatorEp, err.Format());
                return nullptr;
            }
            if (aggregator.onDeviceRegistered)
            {
                aggregator.onDeviceRegistered();
            }
            gConstructedDevices.push_back(std::move(aggregator.device));

            unsigned int createdCount = 0;
            unsigned int skippedCount = 0;

            for (const auto & deviceType : deviceFactory.SupportedDeviceTypes())
            {
                if (deviceType == "aggregator" || deviceType == "bridged-node")
                {
                    continue;
                }

                size_t freeInternalHeap = heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
                if (freeInternalHeap < kMinFreeInternalHeap)
                {
                    ESP_LOGW(TAG, "Not creating '%s': low internal heap (%u bytes free, threshold %u bytes)", deviceType.c_str(),
                             static_cast<unsigned int>(freeInternalHeap), static_cast<unsigned int>(kMinFreeInternalHeap));
                    skippedCount++;
                    continue;
                }

                auto bridgedNode = deviceFactory.Create("bridged-node", KebabCaseToTitleCase(deviceType));
                if (bridgedNode.device == nullptr)
                {
                    ESP_LOGE(TAG, "Failed to create bridged-node for '%s'", deviceType.c_str());
                    skippedCount++;
                    continue;
                }
                EndpointId bnEp = endpointIdAllocator.Allocate();
                endpointIdAllocator.ForceNext(bnEp);
                ESP_LOGI(TAG, "Registering bridged-node for '%s' on endpoint %u (parent %u)", deviceType.c_str(), bnEp,
                         aggregatorEp);
                err = bridgedNode.device->Register(endpointIdAllocator, dataModelProvider,
                                                   EndpointComposition::WithParent(aggregatorEp));
                if (err != CHIP_NO_ERROR)
                {
                    ESP_LOGE(TAG, "Failed to register bridged-node for '%s' on endpoint %u: %" CHIP_ERROR_FORMAT,
                             deviceType.c_str(), bnEp, err.Format());
                    skippedCount++;
                    continue;
                }

                auto device = deviceFactory.Create(deviceType);
                if (device.device == nullptr)
                {
                    ESP_LOGE(TAG, "Failed to create device '%s'", deviceType.c_str());
                    bridgedNode.device->Unregister(dataModelProvider);
                    skippedCount++;
                    continue;
                }
                ESP_LOGI(TAG, "Registering device '%s' with parent %u", deviceType.c_str(), bnEp);
                err = device.device->Register(endpointIdAllocator, dataModelProvider, EndpointComposition::WithParent(bnEp));
                if (err != CHIP_NO_ERROR)
                {
                    ESP_LOGE(TAG, "Failed to register device '%s' with parent %u: %" CHIP_ERROR_FORMAT, deviceType.c_str(), bnEp,
                             err.Format());
                    bridgedNode.device->Unregister(dataModelProvider);
                    skippedCount++;
                    continue;
                }

                if (bridgedNode.onDeviceRegistered)
                {
                    bridgedNode.onDeviceRegistered();
                }
                if (device.onDeviceRegistered)
                {
                    device.onDeviceRegistered();
                }

                gConstructedDevices.push_back(std::move(bridgedNode.device));
                gConstructedDevices.push_back(std::move(device.device));
                createdCount++;
            }
            ESP_LOGI(TAG,
                     "Aggregator initialization complete: %u bridged devices created, %u devices skipped (remaining internal heap: "
                     "%u bytes)",
                     createdCount, skippedCount,
                     static_cast<unsigned int>(heap_caps_get_free_size(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL)));
        }
        else
        {
            std::string defaultDevName;
            for (const auto & dev : deviceFactory.SupportedDeviceTypes())
            {
                if (dev != "aggregator" && dev != "bridged-node")
                {
                    defaultDevName = dev;
                    break;
                }
            }
            if (defaultDevName.empty())
            {
                defaultDevName = deviceFactory.GetDefaultDevice();
            }
            SetActiveDeviceType(defaultDevName);
            auto defaultDevice = deviceFactory.Create(defaultDevName);
            if (defaultDevice.device == nullptr)
            {
                ESP_LOGE(TAG, "Failed to create default device %s", defaultDevName.c_str());
                return nullptr;
            }
            endpointIdAllocator.ForceNext(CONFIG_ALL_DEVICES_ENDPOINT);
            ESP_LOGI(TAG, "Registering default device '%s' on endpoint %u", defaultDevName.c_str(),
                     static_cast<unsigned int>(CONFIG_ALL_DEVICES_ENDPOINT));
            err = defaultDevice.device->Register(endpointIdAllocator, dataModelProvider);
            if (err != CHIP_NO_ERROR)
            {
                ESP_LOGE(TAG, "Failed to register default device '%s': %" CHIP_ERROR_FORMAT, defaultDevName.c_str(), err.Format());
                return nullptr;
            }
            if (defaultDevice.onDeviceRegistered)
            {
                defaultDevice.onDeviceRegistered();
            }
            gConstructedDevices.push_back(std::move(defaultDevice.device));
        }
    }
    else
    {
        if (gDeviceType.empty() || !deviceFactory.IsValidDevice(gDeviceType))
        {
            std::string fallback;
            for (const auto & dev : deviceFactory.SupportedDeviceTypes())
            {
                if (dev != "aggregator" && dev != "bridged-node")
                {
                    fallback = dev;
                    break;
                }
            }
            if (fallback.empty())
            {
                fallback = deviceFactory.GetDefaultDevice();
            }
            SetActiveDeviceType(std::move(fallback));
        }
        auto device = deviceFactory.Create(gDeviceType);
        if (device.device == nullptr)
        {
            ESP_LOGE(TAG, "Failed to create device of type: %s", gDeviceType.c_str());
            return nullptr;
        }

        endpointIdAllocator.ForceNext(CONFIG_ALL_DEVICES_ENDPOINT);
        ESP_LOGI(TAG, "Registering device '%s' on endpoint %u", gDeviceType.c_str(),
                 static_cast<unsigned int>(CONFIG_ALL_DEVICES_ENDPOINT));
        err = device.device->Register(endpointIdAllocator, dataModelProvider);
        if (err != CHIP_NO_ERROR)
        {
            ESP_LOGE(TAG, "Failed to register device '%s': %" CHIP_ERROR_FORMAT, gDeviceType.c_str(), err.Format());
            return nullptr;
        }
        if (device.onDeviceRegistered)
        {
            device.onDeviceRegistered();
        }

        gConstructedDevices.push_back(std::move(device.device));
    }

    return &dataModelProvider;
}

void InitServer(intptr_t context)
{
    static chip::CommonCaseDeviceServerInitParams initParams;
    CHIP_ERROR err = initParams.InitializeStaticResourcesBeforeServerInit();
    if (err != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "InitializeStaticResourcesBeforeServerInit() failed: %" CHIP_ERROR_FORMAT, err.Format());
        return;
    }

    // Initialize the test event trigger delegate
    static SimpleTestEventTriggerDelegate sTestEventTriggerDelegate;
    initParams.testEventTriggerDelegate = &sTestEventTriggerDelegate;

    AppDeviceFactory::GetInstance().Init(AppDeviceFactory::Context{
        .groupDataProvider        = gGroupDataProvider,                     //
        .fabricTable              = Server::GetInstance().GetFabricTable(), //
        .timerDelegate            = gTimerDelegate,                         //
        .storageDelegate          = *initParams.persistentStorageDelegate,  //
        .diagnosticDataProvider   = DeviceLayer::GetDiagnosticDataProvider(),
        .platformManager          = DeviceLayer::PlatformMgr(),
        .failSafeContext          = Server::GetInstance().GetFailSafeContext(),
        .bindingTable             = Clusters::Binding::Table::GetInstance(),
        .bindingManager           = Clusters::Binding::Manager::GetInstance(),
        .testEventTriggerDelegate = *initParams.testEventTriggerDelegate,
        .identifyDelegate         = gIdentifyDelegate,
    });

#if ALL_DEVICES_ENABLE_DIMMABLE_LIGHT
    // Override dimmable-light with ESP32 hardware implementation that drives a real LED
    AppDeviceFactory::GetInstance().RegisterCreator("dimmable-light", [&]() {
        return AppDeviceFactory::MakeDevice<ESP32DimmableLight>(ESP32DimmableLight::Context{
            .groupDataProvider = gGroupDataProvider,
            .fabricTable       = Server::GetInstance().GetFabricTable(),
            .timerDelegate     = gTimerDelegate,
            .identifyDelegate  = gIdentifyDelegate,
        });
    });
#endif

